app/controllers/deals_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1  ORDER BY stores.created_at DESC LIMIT 1  [["id", 270]]
SELECT "deals".* FROM "deals" INNER JOIN "stores" ON "stores"."id" = "deals"."store_id" INNER JOIN "users" ON "users"."id" = "deals"."approved_by" LEFT JOIN malls
---
  def load_deals_resource
    if @store || params[:store_id].present?
      @store = Store.find(params[:store_id]) if params[:store_id].present?
      @deal = params[:id].present? ? @store.deals.find(params[:id]) : @store.deals.new
      authorize! :index, @deal
      @deals = @store.deals
    elsif @mall
      @deal = @mall.stores.first.try(:deals).try(:new)